myinit.org
#+STARTUP: overview

* Introduction
This is my =.emacsd= folder to load my preferred Emacs configuration. Although it "should" work out of the box, I've added some extra steps I've needed in the past to the section [[*Misc requirements][Misc requirements]].

* Contents :TOC_2:
- [[#introduction][Introduction]]
- [[#initialisation][Initialisation]]
  - [[#lexical-scoping][Lexical scoping]]
  - [[#minimal-emacs][Minimal-Emacs]]
  - [[#use-package][use-package]]
  - [[#auto-save][auto-save]]
  - [[#my-defaults][My defaults]]
  - [[#shell-environment][Shell environment]]
  - [[#custom-key-bindings][Custom key bindings]]
  - [[#misc-requirements][Misc requirements]]
- [[#ui][UI]]
  - [[#theme][Theme]]
  - [[#dashboard][Dashboard]]
- [[#general-packages][General packages]]
  - [[#from-mimimal-emacs][From mimimal emacs]]
  - [[#try][Try]]
  - [[#projectile][Projectile]]
  - [[#documentation][Documentation]]
  - [[#hydra][Hydra]]
  - [[#org][Org]]
  - [[#minibuffer][Minibuffer]]
  - [[#navigation][Navigation]]
  - [[#editing][Editing]]
- [[#programming-packages][Programming packages]]
  - [[#defaults][Defaults]]
  - [[#lsp][LSP]]
  - [[#tree-sitter][Tree-sitter]]
  - [[#flycheck][flycheck]]
  - [[#dap-mode][dap-mode]]
  - [[#company-mode][company-mode]]
  - [[#git][Git]]
  - [[#parenthesis][Parenthesis]]
  - [[#indentation][Indentation]]
  - [[#languages][Languages]]
- [[#writing-packages][Writing packages]]
  - [[#defaults-1][Defaults]]
  - [[#flyspell][Flyspell]]
  - [[#ispell][Ispell]]
  - [[#languagetools][LanguageTools]]
  - [[#writegood-mode][writegood-mode]]
  - [[#latex][LaTeX]]

* TODO Initialisation
TODO the order of these could be better

This section contains the basic commands to initialize your GNU Emacs with some of my default preferences.

** TODO Lexical scoping
In Emacs 30, a warning has been introduced when a file is loaded without a lexical binding directive, either =t= or =nil=. This warning is part of the ongoing transition towards making lexical binding the default in future versions of Emacs. To avoid this warning, you can add the following line at the top of your Emacs Lisp files:

#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-
#+end_src

This cookie tells Emacs to use lexical scoping for variables which is now the default and recommended style for almost all modern Emacs Lisp code. Without it, older dynamic scoping is used, which can cause weird bugs or performance issues in some cases. I also had to add this to some files that caused a warning on startup (not required but I found it annoying)

** Minimal-Emacs
The [[https://github.com/KaiRJ/minimal-emacs.d?tab=readme-ov-file#customizations-packages-post-initel][minimal-emacs.d]] project is a lightweight and optimized Emacs base (init.el and early-init.el) that gives you full control over your configuration (without the complexity of, for instance, Doom Emacs or Spacemacs). It provides better defaults, an optimized startup, and a clean foundation for building your own vanilla Emacs setup. See the linked page for more details of the defaults set.

** use-package
=use-package= is automatically set up by =minimal-emacs=, but to save some typing I'm also turning on always using =ensure t=:

#+begin_src emacs-lisp
  (setq use-package-always-ensure t)
#+end_src

If you are having trouble when starting Emacs, you can pass Emacs the =--debug-init= command line flag. To get even more information when using that flag I've added these options:

#+begin_src emacs-lisp
  (when init-file-debug
    (setq use-package-verbose t
          use-package-expand-minimally nil
          use-package-compute-statistics t))
#+end_src

** auto-save
Enabling auto-save-mode mitigates the risk of data loss in the event of a crash. Auto-saved data can be recovered using the =recover-file= or =recover-session= functions:

#+begin_src emacs-lisp
  (setq auto-save-default t)
  (setq auto-save-interval 300)
  (setq auto-save-timeout 30)
#+end_src

When auto-save-visited-mode is enabled, Emacs will auto-save file-visiting buffers after a certain amount of idle time if the user forgets to save it with =save-buffer= or =C-x s= for example.

#+begin_src emacs-lisp
  (setq auto-save-visited-interval 5) ;; Save after 5 seconds if inactivity
  (auto-save-visited-mode 1)
#+end_src

** My defaults
On top of the [[https://github.com/KaiRJ/minimal-emacs.d?tab=readme-ov-file#customizations-packages-post-initel][minimal-emacs.d]] defaults these are some additional values I use:

#+begin_src emacs-lisp
  (use-package emacs
    :ensure nil
    :hook
    ;; Clean up white space when file is saved
    (before-save-hook . whitespace-cleanup)
    :custom
    ;; Merge system's and Emacs' clipboard
    (select-enable-clipboard t)
    ;; Save current (system) clipboard before replacing
    (save-interprogram-paste-before-kill t)
    ;; C-n adds new line if reaches end of buffer
    (next-line-add-newlines t)
    ;; Delete highlighted text by typing
    (delete-selection-mode 1)
    ;; don't compact font caches during GC.
    (inhibit-compacting-font-caches t)
    :config
    ;; Font size
    (set-face-attribute 'default nil :height 140))
#+end_src
** Shell environment
I'm using the [[https://github.com/purcell/exec-path-from-shell][exec-path-from-shell]] package so that my terminal and Emacs enviroments are the same:

#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :config
    (exec-path-from-shell-initialize))
#+end_src

** TODO Custom key bindings
TODO move redfine into the emacs usepackage above.
TODO I think move all my functions into their own section, maybe at end of their own heading

Here I change and define any small key binding that I use frequently in my workflow. Note I change package specific key binds when I install that package.

*** Redefine
This section changes some key bindings or edits there behaviour to how I like it.

#+begin_src emacs-lisp
  ;; Remap quary replace so its not on M-% which is screenshot on mac
  (keymap-global-set "M-r" 'quary-repace)

  ;; Switch to new window on window split
  (global-set-key "\C-x2"
                  (lambda ()
                    (interactive)
                    (split-window-vertically)
                    (other-window 1)))

  (global-set-key "\C-x3"
                  (lambda ()
                    (interactive)
                    (split-window-horizontally)
                    (other-window 1)))

  ;; Bind comment-line to C-; instead of C-x C-;
  (global-set-key (kbd "C-;") 'comment-line)
#+end_src

*** Duplicate line

Duplicates the current line below.

#+begin_src emacs-lisp
  (defun kai/duplicate-line()
    "Duplicate the current line below."
    (interactive)
    (move-beginning-of-line 1)
    (kill-line)
    (yank)
    (open-line 1)
    (next-line 1)
    (yank))

  (global-set-key (kbd "s-d") 'kai/duplicate-line)
#+end_src

*** Makefile Commands

Key bindings to quickly make and clean makefile projects.

#+begin_src emacs-lisp
  (defun kai/compile-build ()
    "Compile using 'make build'."
    (interactive)
    (compile "make build"))

  (defun kai/compile-clean ()
    "Clean using 'make clean'."
    (interactive)
    (compile "make clean"))

  ;; makefile keybindings
  (global-set-key (kbd "<f5>") 'kai/compile-build)
  (global-set-key (kbd "<f6>") 'kai/compile-clean)
#+end_src
*** Kill buff
Kill the current buffer instead of having to pick it.

#+begin_src emacs-lisp
  (defun kai/kill-this-buffer ()
    "Kill the current buffer."
    (interactive)
    (kill-buffer (current-buffer)))

  (global-set-key (kbd "C-x k") 'kai/kill-this-buffer)
#+end_src
*** Scroll
Scroll window up/down by one line

#+begin_src emacs-lisp
  (global-set-key (kbd "M-n") (kbd "C-u 1 C-v"))
  (global-set-key (kbd "M-p") (kbd "C-u 1 M-v"))
#+end_src
*** Comment line
#+begin_src emacs-lisp
  (defun kai/comment-line-stay ()
    "Toggle comment on current line without moving point."
    (interactive)
    (let ((orig-pos (point)))
      (comment-line nil)  ;; nil = behave normally (toggle)
      (goto-char orig-pos)))

  (global-set-key (kbd "C-;") 'kai/comment-line-stay)
#+end_src
** Misc requirements
These are instructions you may need for a fresh install of emacs using this init file:

- Running Emacs from pop shop caused errors with the environment being completely different, I fixed this by downloading directly from [[https://www.gnu.org/software/emacs/][Emacs]].

- For the [[https://github.com/seagle0128/doom-modeline][doom-modeline]] run =M-x nerd-icons-install-fonts= to install the necessary fonts.

- Might need to also run =M-x all-the-icons-install-fonts=,
#+begin_src emacs-lisp
  (use-package all-the-icons)
#+end_src

- For =lsp-mode= you will need to install all the language servers, eg. =sudo apt install clangd=. But emacs should prompt you to install them automatically anyway as you open files, if you run into issues just install them from the terminal.
  - On linux, I ran into an error of Emacs not being able to find =npm= to install for example the =bash-ls=.
  - I therefore had to install =nvm= in my terminal, following the instructions [[https://github.com/nvm-sh/nvm?tab=readme-ov-file#installing-and-updating][here]] (=apt= installs old versions that didn't work either).
  - For lsp-itex, the automatic install wasn't working but just try M-x lsp-install-server ltex-ls instead. Or if you download directly note to place the executable in =~/.emacs.d/.cache/lsp/ltex-ls/latest=.

- For =dap-mode= a one-time step is required to download the extension and set it up automatically  =M-x dap-cpptools-setup= then you are good start debugging.

* UI
** Theme
I'm using the [[https://github.com/doomemacs/themes][doom-one]] theme:

#+begin_src emacs-lisp
  (use-package doom-themes
    :config
    (load-theme 'doom-one t)
    (doom-themes-visual-bell-config) ;; Enable flashing mode-line on errors
    (doom-themes-org-config))        ;; Corrects (and improves) org-mode's native fontification.
#+end_src

And the [[https://github.com/seagle0128/doom-modeline][doom-modeline]]:

#+begin_src emacs-lisp
  (use-package doom-modeline
    :init (doom-modeline-mode)
    :custom
    (doom-modeline-icon (display-graphic-p))
    (doom-modeline-mu4e t)
    (doom-modeline-buffer-modification-icon nil)
    (doom-modeline-buffer-file-name-style 'file-name-with-project)
    (doom-modeline-position-column-line-format '("L%l"))
    (doom-modeline-checker-simple-format nil)
    (doom-modeline-buffer-encoding nil)
    (doom-modeline-vcs-max-length 12))
#+end_src

** Dashboard
This package gives a nicer startup menu using the [[https://github.com/emacs-dashboard/emacs-dashboard][dashboard]] package.

#+begin_src emacs-lisp
  ;; optional dependancy of emacs-dashboard
  (use-package page-break-lines)

  (use-package dashboard
    :config
    (dashboard-setup-startup-hook)
    :custom
    (dashboard-items '((projects . 5)
                       (recents . 5)))
    (dashboard-set-file-icons t)
    (dashboard-set-heading-icons t)
    (dashboard-set-navigator t)
    (dashboard-startup-banner 'official))
#+end_src

* TODO General packages
TODO write short description
TODO all these need tidied up and put into a sub headings

