myinit.el
;; -*- lexical-binding: t; -*-

(setq use-package-always-ensure t)

(when init-file-debug
  (setq use-package-verbose t
        use-package-expand-minimally nil
        use-package-compute-statistics t))

(use-package emacs
  :ensure nil
  :hook
  ;; Clean up white space when file is saved
  (before-save-hook . whitespace-cleanup)
  :custom
  ;; Merge system's and Emacs' clipboard
  (select-enable-clipboard t)
  ;; Save current (system) clipboard before replacing
  (save-interprogram-paste-before-kill t)
  ;; C-n adds new line if reaches end of buffer
  (next-line-add-newlines t)
  ;; Delete highlighted text by typing
  (delete-selection-mode 1)
  ;; don't compact font caches during GC.
  (inhibit-compacting-font-caches t)
  :config
  ;; Font size
  (set-face-attribute 'default nil :height 140))

(use-package exec-path-from-shell
  :config
  (exec-path-from-shell-initialize))

;; Remap quary replace so its not on M-% which is screenshot on mac
(keymap-global-set "M-r" 'quary-repace)

;; Switch to new window on window split
(global-set-key "\C-x2"
                (lambda ()
                  (interactive)
                  (split-window-vertically)
                  (other-window 1)))

(global-set-key "\C-x3"
                (lambda ()
                  (interactive)
                  (split-window-horizontally)
                  (other-window 1)))

;; Bind comment-line to C-; instead of C-x C-;
(global-set-key (kbd "C-;") 'comment-line)

(defun kai/duplicate-line()
  "Duplicate the current line below."
  (interactive)
  (move-beginning-of-line 1)
  (kill-line)
  (yank)
  (open-line 1)
  (next-line 1)
  (yank))

(global-set-key (kbd "s-d") 'kai/duplicate-line)

(defun kai/compile-build ()
  "Compile using 'make build'."
  (interactive)
  (compile "make build"))

(defun kai/compile-clean ()
  "Clean using 'make clean'."
  (interactive)
  (compile "make clean"))

;; makefile keybindings
(global-set-key (kbd "<f5>") 'kai/compile-build)
(global-set-key (kbd "<f6>") 'kai/compile-clean)

(defun kai/kill-this-buffer ()
  "Kill the current buffer."
  (interactive)
  (kill-buffer (current-buffer)))

(global-set-key (kbd "C-x k") 'kai/kill-this-buffer)

(global-set-key (kbd "M-n") (kbd "C-u 1 C-v"))
(global-set-key (kbd "M-p") (kbd "C-u 1 M-v"))

(defun kai/comment-line-stay ()
  "Toggle comment on current line without moving point."
  (interactive)
  (let ((orig-pos (point)))
    (comment-line nil)  ;; nil = behave normally (toggle)
    (goto-char orig-pos)))

(global-set-key (kbd "C-;") 'kai/comment-line-stay)

(use-package all-the-icons)

(use-package doom-themes
  :config
  (load-theme 'doom-one t)
  (doom-themes-visual-bell-config) ;; Enable flashing mode-line on errors
  (doom-themes-org-config))        ;; Corrects (and improves) org-mode's native fontification.

(use-package doom-modeline
  :init (doom-modeline-mode)
  :custom
  (doom-modeline-icon (display-graphic-p))
  (doom-modeline-mu4e t)
  (doom-modeline-buffer-modification-icon nil)
  (doom-modeline-buffer-file-name-style 'file-name-with-project)
  (doom-modeline-position-column-line-format '("L%l"))
  (doom-modeline-checker-simple-format nil)
  (doom-modeline-buffer-encoding nil)
  (doom-modeline-vcs-max-length 12))

;; optional dependancy of emacs-dashboard
(use-package page-break-lines)

(use-package dashboard
  :config
  (dashboard-setup-startup-hook)
  :custom
  (dashboard-items '((projects . 5)
                     (recents . 5)))
  (dashboard-set-file-icons t)
  (dashboard-set-heading-icons t)
  (dashboard-set-navigator t)
  (dashboard-startup-banner 'official))

(use-package try)
