myinit.org
** TODO From mimimal emacs
TODO split these up and write proper intro to them

#+begin_src emacs-lisp
  ;; Auto-revert in Emacs is a feature that automatically updates the
  ;; contents of a buffer to reflect changes made to the underlying file
  ;; on disk.
  (use-package autorevert
    :ensure nil
    :commands (auto-revert-mode global-auto-revert-mode)
    :hook
    (after-init . global-auto-revert-mode)
    :custom
    (auto-revert-interval 3)
    (auto-revert-remote-files nil)
    (auto-revert-use-notify t)
    (auto-revert-avoid-polling nil)
    (auto-revert-verbose t))

  ;; Recentf is an Emacs package that maintains a list of recently
  ;; accessed files, making it easier to reopen files you have worked on
  ;; recently.
  (use-package recentf
    :ensure nil
    :commands (recentf-mode recentf-cleanup)
    :hook
    (after-init . recentf-mode)

    :custom
    (recentf-auto-cleanup (if (daemonp) 300 'never))
    (recentf-exclude
     (list "\\.tar$" "\\.tbz2$" "\\.tbz$" "\\.tgz$" "\\.bz2$"
           "\\.bz$" "\\.gz$" "\\.gzip$" "\\.xz$" "\\.zip$"
           "\\.7z$" "\\.rar$"
           "COMMIT_EDITMSG\\'"
           "\\.\\(?:gz\\|gif\\|svg\\|png\\|jpe?g\\|bmp\\|xpm\\)$"
           "-autoloads\\.el$" "autoload\\.el$"))

    :config
    ;; A cleanup depth of -90 ensures that `recentf-cleanup' runs before
    ;; `recentf-save-list', allowing stale entries to be removed before the list
    ;; is saved by `recentf-save-list', which is automatically added to
    ;; `kill-emacs-hook' by `recentf-mode'.
    (add-hook 'kill-emacs-hook #'recentf-cleanup -90))

  ;; savehist is an Emacs feature that preserves the minibuffer history between
  ;; sessions. It saves the history of inputs in the minibuffer, such as commands,
  ;; search strings, and other prompts, to a file. This allows users to retain
  ;; their minibuffer history across Emacs restarts.
  (use-package savehist
    :ensure nil
    :commands (savehist-mode savehist-save)
    :hook
    (after-init . savehist-mode)
    :custom
    (savehist-autosave-interval 600)
    (savehist-additional-variables
     '(kill-ring                        ; clipboard
       register-alist                   ; macros
       mark-ring global-mark-ring       ; marks
       search-ring regexp-search-ring)))

  ;; save-place-mode enables Emacs to remember the last location within a file
  ;; upon reopening. This feature is particularly beneficial for resuming work at
  ;; the precise point where you previously left off.
  (use-package saveplace
    :ensure nil
    :commands (save-place-mode save-place-local-mode)
    :hook
    (after-init . save-place-mode)
    :custom
    (save-place-limit 400))
#+end_src
** Try
Try different packages without having to install them.

#+begin_src emacs-lisp
  (use-package try)
#+end_src
** TODO Projectile
TODO look into built in version of this, project.el i think

#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    :init
    (projectile-mode +1)
    :bind (:map projectile-mode-map
                ("s-p" . projectile-command-map)
                ("C-c p" . projectile-command-map)))

  (setq projectile-project-search-path '("~/git/"))
#+end_src

** Documentation
To have a more user-friendly documentation I use the [[https://github.com/Wilfred/helpful][helpful]] package.

#+begin_src emacs-lisp
  (use-package helpful
    :commands (helpful-at-point
               helpful-callable
               helpful-command
               helpful-function
               helpful-key
               helpful-macro
               helpful-variable)
    :bind
    ([remap display-local-help] . helpful-at-point)
    ([remap describe-function] . helpful-callable)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-symbol] . helpful-symbol)
    ([remap describe-key] . helpful-key)
    ([remap describe-command] . helpful-command))
#+end_src

** TODO Hydra
could maybe be its own head?
could put this is one of like (my own packages or my own lisp)
** TODO Org
TODO needs a big tidy up (could be its own heading?, see https://github.com/rememberYou/.emacs.d/blob/master/config.org#org-mode

and check out https://github.com/org-roam/org-roam

A lot of these changes are based of [[https://doc.norang.ca/org-mode.html#HowToUseThisDocument][this]].

*** Tweaks
#+begin_src emacs-lisp
  ;; indent with tabs for better readability
  (add-hook 'org-mode-hook #'org-indent-mode)
  ;; (setq org-indent-indentation-per-level 4)

  ;; When editing org-files with source-blocks, we want the source blocks to be themed as they would in their native mode.
  (setq org-src-fontify-natively t
    org-src-tab-acts-natively t
    org-confirm-babel-evaluate nil)
#+end_src

*** Keybindings
#+begin_src emacs-lisp
  ;; Standard key bindings
  ;; (global-set-key (kbd "\C-c l") 'org-store-link)
  (global-set-key (kbd "\C-c a") 'org-agenda)
  (global-set-key (kbd "\C-c c") 'org-capture)
  (global-set-key (kbd "\C-c b") 'org-iswitchb)
#+end_src

*** Agenda
#+begin_src emacs-lisp
  ;;
  (setq org-agenda-files (quote ("~/git/agenda/phd/simulations.org"
                                 "~/git/agenda/phd/prominence.org"
                                 "~/git/agenda/personal.org"
                                 "~/git/agenda/emacs.org")))

  ;; Define the keywords for the agenda
  (setq org-todo-keywords
        '((sequence "TODO(t)"    "NEXT(n)" "|" "DONE(d)")
          (sequence "WAITING(w)" "HOLD(h)" "|" "CANCELLED(c)")))

  (setq org-log-done 'time)

  ;; Set default column view headings: Task Total-Time Time-Stamp
  (setq org-columns-default-format "%50ITEM(Task) %TIMESTAMP_IA")

  ;; Colour the keywords
  (setq org-todo-keyword-faces
        (quote (("TODO"      :foreground "red"          :weight bold)
                ("NEXT"      :foreground "blue"         :weight bold)
                ("DONE"      :foreground "forest green" :weight bold)
                ("WAITING"   :foreground "orange"       :weight bold)
                ("HOLD"      :foreground "magenta"      :weight bold)
                ("CANCELLED" :foreground "forest green" :weight bold))))
#+end_src

*** Packages
**** org-bullets
#+BEGIN_SRC emacs-lisp
  ;; Org bullets makes things look pretty
  (use-package org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
  #+END_SRC
**** toc-org
In order to auto generate the table of contents of this file (and others) I'm using the [[https://github.com/snosov1/toc-org][toc-org]] package. Every time you save an org file, the first headline with a =:TOC:= tag will be updated with the current table of contents (=:TOC_2:= sets the max depth to 2).

#+begin_src emacs-lisp
  (use-package toc-org
    :hook (org-mode . toc-org-enable))
#+end_src
** Minibuffer
These packages make everything in the minibuffer nicer and easier.

*** Ivy / Counsel / Swiper

Swiper gives us a really efficient incremental search with regular expressions and Ivy/Counsel replace a lot of ido or helms completion functionality.

#+begin_src emacs-lisp
  (use-package counsel ;; installs ivy and swiper as dependancies
    :config (ivy-mode)

    :custom
    (ivy-use-virtual-buffers t)
    (ivy-display-style 'fancy)
    (ivy-wrap t)

    ;; should_ speed swiper up
    (swiper-use-visual-line nil)
    (swiper-use-visual-line-p (lambda (a) nil))

    ;; ignore certain files in find-file
    (counsel-find-file-ignore-regexp "\\(?:\\.DS_Store\\)")
    (ivy-extra-directories nil) ;; /. and /..

    :bind (("C-x b"   . ivy-switch-buffer)
           ("M-w"     . ivy-kill-ring-save)
           ("M-x"     . counsel-M-x)
           ("C-x C-f" . counsel-find-file)
           ("M-y"     . counsel-yank-pop)
           ("C-h f"   . counsel-describe-function)
           ("C-h v"   . counsel-describe-variable)
           ("C-h l"   . counsel-find-library)
           ("C-s"     . swiper)
           ;; (global-set-key (kbd "C-r") 'swiper) ;; using this for quary-replace
           ("s-s"     . counsel-ag)
           ("M-i"     . counsel-imenu)))
#+end_src

*** which key
Display possible key bindings following incomplete command.

#+begin_src emacs-lisp
  (use-package which-key
    :custom (which-key-idle-delay 0.5)
    :config (which-key-mode))
#+end_src
*** amx
Alternative interface for =M-x=. Prioritizes most used commands and shows keyboard shortcuts

#+begin_src emacs-lisp
  (use-package amx
    :custom
    (amx-backend 'auto)
    :config
    (amx-mode 1))
#+end_src
*** TODO marginalia
What does this do?

#+begin_src emacs-lisp
  (use-package marginalia
    :after ivy
    :init (marginalia-mode)
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil)))
#+end_src
** Navigation
Section dedicated to managing buffers, files, and windows on GNU Emacs to provide a more pleasant experience.

*** Buffers
**** Ibuffer

Buffers can quickly become a mess to manage. To manage them better, I use the =ibuffer= built-in package instead of buffer-menu, to have a nicer visual interface with a syntax color.

#+begin_src emacs-lisp
  (use-package ibuffer
    :ensure nil
    :bind ("C-x C-b" . ibuffer)
    :config
    ;; (setq ibuffer-default-sorting-mode 'major-mode)
    (setq ibuffer-show-empty-filter-groups nil))
#+end_src

**** ibuffer-vc

I organise my ibuffer by git repos. Evenentually would like to do this by projectile so it's more generic.

#+begin_src emacs-lisp
  (use-package ibuffer-vc
    :after ibuffer)

  (defun ibuffer-apply-filter-groups ()
    "Combine my saved ibuffer filter groups with those generated
       by `ibuffer-vc-generate-filter-groups-by-vc-root' taken from `https://github.com/reinh/dotemacs/blob/master/conf/init.org#ido'"
    (interactive)
    (setq ibuffer-filter-groups
          (append
           (ibuffer-vc-generate-filter-groups-by-vc-root)
           ibuffer-saved-filter-groups))
    (message "ibuffer-vc: groups set")
    (let ((ibuf (get-buffer "*Ibuffer*")))
      (when ibuf
        (with-current-buffer ibuf
          (pop-to-buffer ibuf)
          (ibuffer-update nil t)))))

  ;; Tell ibuffer to load the group automatically
  (add-hook 'ibuffer-hook 'ibuffer-apply-filter-groups)
#+end_src

**** imenu-list

[[https://github.com/bmag/imenu-list][imenu-list]] provides a really nice view of the structure of a file.

#+begin_src emacs-lisp
  (use-package imenu-list
    :ensure t)

  (global-set-key (kbd "s-i") #'imenu-list-smart-toggle)
  (setq imenu-list-focus-after-activation t)
  (setq imenu-list-auto-resize t)

  (setq imenu-list-after-jump-hook nil)
  (add-hook 'imenu-list-after-jump-hook #'top)
#+end_src
*** Windows
