myinit.el

(use-package projectile
  :ensure t
  :init
  (projectile-mode +1)
  :bind (:map projectile-mode-map
              ("s-p" . projectile-command-map)
              ("C-c p" . projectile-command-map)))

(setq projectile-project-search-path '("~/git/"))

(use-package helpful
  :commands (helpful-at-point
             helpful-callable
             helpful-command
             helpful-function
             helpful-key
             helpful-macro
             helpful-variable)
  :bind
  ([remap display-local-help] . helpful-at-point)
  ([remap describe-function] . helpful-callable)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-symbol] . helpful-symbol)
  ([remap describe-key] . helpful-key)
  ([remap describe-command] . helpful-command))

;; indent with tabs for better readability
(add-hook 'org-mode-hook #'org-indent-mode)
;; (setq org-indent-indentation-per-level 4)

;; When editing org-files with source-blocks, we want the source blocks to be themed as they would in their native mode.
(setq org-src-fontify-natively t
  org-src-tab-acts-natively t
  org-confirm-babel-evaluate nil)

;; Standard key bindings
;; (global-set-key (kbd "\C-c l") 'org-store-link)
(global-set-key (kbd "\C-c a") 'org-agenda)
(global-set-key (kbd "\C-c c") 'org-capture)
(global-set-key (kbd "\C-c b") 'org-iswitchb)

;;
(setq org-agenda-files (quote ("~/git/agenda/phd/simulations.org"
                               "~/git/agenda/phd/prominence.org"
                               "~/git/agenda/personal.org"
                               "~/git/agenda/emacs.org")))

;; Define the keywords for the agenda
(setq org-todo-keywords
      '((sequence "TODO(t)"    "NEXT(n)" "|" "DONE(d)")
        (sequence "WAITING(w)" "HOLD(h)" "|" "CANCELLED(c)")))

(setq org-log-done 'time)

;; Set default column view headings: Task Total-Time Time-Stamp
(setq org-columns-default-format "%50ITEM(Task) %TIMESTAMP_IA")

;; Colour the keywords
(setq org-todo-keyword-faces
      (quote (("TODO"      :foreground "red"          :weight bold)
              ("NEXT"      :foreground "blue"         :weight bold)
              ("DONE"      :foreground "forest green" :weight bold)
              ("WAITING"   :foreground "orange"       :weight bold)
              ("HOLD"      :foreground "magenta"      :weight bold)
              ("CANCELLED" :foreground "forest green" :weight bold))))

;; Org bullets makes things look pretty
(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

(use-package counsel ;; installs ivy and swiper as dependancies
  :config (ivy-mode)

  :custom
  (ivy-use-virtual-buffers t)
  (ivy-display-style 'fancy)
  (ivy-wrap t)

  ;; should_ speed swiper up
  (swiper-use-visual-line nil)
  (swiper-use-visual-line-p (lambda (a) nil))

  ;; ignore certain files in find-file
  (counsel-find-file-ignore-regexp "\\(?:\\.DS_Store\\)")
  (ivy-extra-directories nil) ;; /. and /..

  :bind (("C-x b"   . ivy-switch-buffer)
         ("M-w"     . ivy-kill-ring-save)
         ("M-x"     . counsel-M-x)
         ("C-x C-f" . counsel-find-file)
         ("M-y"     . counsel-yank-pop)
         ("C-h f"   . counsel-describe-function)
         ("C-h v"   . counsel-describe-variable)
         ("C-h l"   . counsel-find-library)
         ("C-s"     . swiper)
         ;; (global-set-key (kbd "C-r") 'swiper) ;; using this for quary-replace
         ("s-s"     . counsel-ag)
         ("M-i"     . counsel-imenu)))

(use-package which-key
  :custom (which-key-idle-delay 0.5)
  :config (which-key-mode))

(use-package amx
  :custom
  (amx-backend 'auto)
  :config
  (amx-mode 1))

(use-package marginalia
  :after ivy
  :init (marginalia-mode)
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil)))

(use-package ibuffer
  :ensure nil
  :bind ("C-x C-b" . ibuffer)
  :config
  ;; (setq ibuffer-default-sorting-mode 'major-mode)
  (setq ibuffer-show-empty-filter-groups nil))

(use-package ibuffer-vc
  :after ibuffer)

(defun ibuffer-apply-filter-groups ()
  "Combine my saved ibuffer filter groups with those generated
     by `ibuffer-vc-generate-filter-groups-by-vc-root' taken from `https://github.com/reinh/dotemacs/blob/master/conf/init.org#ido'"
  (interactive)
  (setq ibuffer-filter-groups
        (append
         (ibuffer-vc-generate-filter-groups-by-vc-root)
         ibuffer-saved-filter-groups))
  (message "ibuffer-vc: groups set")
  (let ((ibuf (get-buffer "*Ibuffer*")))
    (when ibuf
      (with-current-buffer ibuf
        (pop-to-buffer ibuf)
        (ibuffer-update nil t)))))

;; Tell ibuffer to load the group automatically
(add-hook 'ibuffer-hook 'ibuffer-apply-filter-groups)

(use-package imenu-list
  :ensure t)

(global-set-key (kbd "s-i") #'imenu-list-smart-toggle)
(setq imenu-list-focus-after-activation t)
(setq imenu-list-auto-resize t)

(setq imenu-list-after-jump-hook nil)
(add-hook 'imenu-list-after-jump-hook #'top)
