myinit.org
**** ace windows
#+BEGIN_SRC emacs-lisp
  ;; for easy window switching between multiple windows
  (use-package ace-window
    :init
    (progn
      ;; bind ace-window to M-o
      (global-set-key (kbd "M-o") 'ace-window)
      ;; set window lables to home row
      (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
      (custom-set-faces
       '(aw-leading-char-face
     ((t (:inherit ace-jump-face-foreground :height 3.0)))))
      ))
#+END_SRC

**** TODO Avy

Add link.

For quicker navigation around windows.

#+Begin_SRC emacs-lisp
  (use-package avy
    :ensure t
    :bind
    ("M-s"     . avy-goto-word-1)
    ("M-g M-g" . 'avy-goto-line))
#+end_src
**** Focus on new windows

Most of the time, I want to split a window and put the focus on it to perform an action. By default GNU Emacs does not give the focus to this new window. I have no idea why this is not the default behavior, but we can easily set this behavior.

#+begin_src emacs-lisp
(use-package window
  :ensure nil
  :bind (("C-x 2" . vsplit-last-buffer)
         ("C-x 3" . hsplit-last-buffer)
         ;; Don't ask before killing a buffer.
         ([remap kill-buffer] . kill-this-buffer))
  :preface
  (defun hsplit-last-buffer ()
    "Focus to the last created horizontal window."
    (interactive)
    (split-window-horizontally)
    (other-window 1))

  (defun vsplit-last-buffer ()
    "Focus to the last created vertical window."
    (interactive)
    (split-window-vertically)
    (other-window 1)))
#+end_src

*** Treemacs
#+begin_src emacs-lisp
  (use-package treemacs
    :config
    (progn
      (setq treemacs-hide-dot-git-directory          t
            treemacs-move-files-by-mouse-dragging    t
            treemacs-sorting                         'alphabetic-asc
            treemacs-width                           28)
      (treemacs-project-follow-mode t)
      (treemacs-resize-icons 24))
    :bind
    (:map global-map
          ("M-0"       . treemacs-select-window)
          ("C-x t 1"   . treemacs-delete-other-windows)
          ("C-x t d"   . treemacs-select-directory)
          ("C-x t t"   . treemacs)
          ("C-x t B"   . treemacs-bookmark)
          ("C-x t C-t" . treemacs-find-file)
          ("C-x t M-t" . treemacs-find-tag)))

  (use-package treemacs-projectile
    :after treemacs)

  (use-package treemacs-magit
    :after treemacs)

  (use-package treemacs-all-the-icons
    :after treemacs all-the-icons
    :config (treemacs-load-theme "all-the-icons"))
#+end_src

*** Scrolling
#+begin_src emacs-lisp
  (use-package ultra-scroll
  :init
  (setq scroll-conservatively 3 ; or whatever value you prefer, since v0.4
        scroll-margin 0)        ; important: scroll-margin>0 not yet supported
  :config
  (ultra-scroll-mode 1))
#+end_src

** TODO Editing
TODO write short description of these
TODO: need to expand on the description of all these packages

*** drag-stuff

It is useful to be able to move a line or a region up and down without having to =kill-region= (=C-w=) and =yank (C-y)=. The [[https://github.com/rejeep/drag-stuff.el][drag-stuff]] package allows you to moves the current work, line or if marked, the current region.

#+begin_src emacs-lisp
  (use-package drag-stuff
    :ensure t
    :config
    (drag-stuff-global-mode 1)
    (global-set-key (kbd "s-<down>") 'drag-stuff-down)
    (global-set-key (kbd "s-<up>") 'drag-stuff-up)
    (global-set-key (kbd "s-<right>") 'drag-stuff-right)
    (global-set-key (kbd "s-<left>") 'drag-stuff-left))
#+end_src
*** TODO yasnippet

TODO: expand intro with some links. could add a keybinding for ivy.

To make editting a coding easier.

#+begin_src emacs-lisp
  (use-package yasnippet-snippets
    :after yasnippet
    :config (yasnippet-snippets-initialize))

  (use-package yasnippet
    :config (yas-global-mode))

  (use-package ivy-yasnippet :after yasnippet)
#+end_src

*** TODO iedit

TODO

#+begin_src emacs-lisp
  (use-package iedit
    :bind
    ("C-r" . iedit-mode)
    :config
    (define-key iedit-mode-keymap (kbd "C-;") nil)) ;; unbind as used for commend-line
#+end_src
*** undo-tree
#+begin_src emacs-lisp
  (use-package undo-tree
    :init
    (global-undo-tree-mode)
    :config
    (setq undo-tree-visualizer-diff t) ;; show difs
    (setq undo-tree-auto-save-history t) ;; save history to file
    (setq undo-tree-visualizer-timestamps t) ;; show timestamps

    ;; Create the undo history directory if it doesn't exist
    (let ((undo-history-dir (expand-file-name "undo-history" user-emacs-directory)))
      (unless (file-directory-p undo-history-dir)
    (make-directory undo-history-dir)))

    ;; Set the directory for undo history files
    (setq undo-tree-history-directory-alist
      `((".*" . ,(expand-file-name "undo-history" user-emacs-directory)))))
#+end_src

*** multiple-cursors

TODO

#+begin_src emacs-lisp
  (use-package multiple-cursors
    :bind
    ;; (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
    ;; (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
    ("C->" . mc/mark-next-like-this)
    ("C-<" . mc/mark-previous-like-this))

    #+end_src
*** expand-region

Expand the marked region in semantic increments (C-- C-= to reduce region).

#+begin_src emacs-lisp
  (use-package expand-region
    :bind
    ("C-=" . er/expand-region))
#+end_src

* TODO Programming packages
** Defaults
#+begin_src emacs-lisp
  (use-package programming
    :ensure nil
    :hook
    (;; Add line numbers to progam modes
     (prog-mode . display-line-numbers-mode)
     ;; Add column fill indicator
     (prog-mode . display-fill-column-indicator-mode)
     ;; Line Wrappings
     (prog-mode . (lambda () (setq truncate-lines t))))
    :custom
    ;; Treat CamelCase as distinct words
    (global-subword-mode 1))
#+end_src
** TODO LSP
TODO need to expand on all this and check them out

The main benefit of using Language Server Protocol (LSP) to configure the management of your programming languages is that LSP servers are also used by other text editors, increasing contributions to these packages.

*** lsp-mode

That's where [[https://github.com/emacs-lsp/lsp-mode][lsp-mode]] comes in!

I was running into problems with lsp-mode and C++, where it would should errors in C++20 but would compile and run fine. I think this was due to the clangd downloaded by lsp-mode being too old, so I've directly set it to be my local download using =lsp-clients-clangd-executable=.

#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook ((prog-mode . lsp-deferred)
           (lsp-mode . lsp-enable-which-key-integration))
    :custom
    (lsp-enable-folding nil)
    (lsp-enable-links nil)
    (lsp-enable-snippet nil)
    (lsp-keymap-prefix "C-c l")
    (lsp-prefer-capf t)                  ;; Use completion-at-point-functions
    (lsp-headerline-breadcrumb-enable t) ;; Show breadcrumbs
    (lsp-clients-clangd-executable "/usr/bin/clangd-20")
    (lsp-clients-clangd-args ("--header-insertion=never")))

    ;; Clangd is fast
  (setq gc-cons-threshold (* 100 1024 1024)
        read-process-output-max (* 1024 1024)
        treemacs-space-between-root-nodes nil
        company-idle-delay 0.500
        company-minimum-prefix-length 1
        lsp-idle-delay 0.1)  ;; clangd is fast
#+end_src

*** TODO lsp-ui
TODO i think this is causing issues with pop os tiling

In addition to =lsp-mode=, it is possible to use =lsp-ui= to get additional information (e.g., documentation) when hovering a variable or a function.

#+begin_src emacs-lisp
  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-sideline-enable t)
    (lsp-ui-doc-enable nil)
    (lsp-ui-doc-position 'at-point))
#+end_src

*** TODO consult-lsp

TODO learn how to use this

When using =lsp=, it is likely that you will encounter programming errors. To navigate through these errors via the minibuffer, you can use a package for that. If like me, you use =consult= with your minibuffer completion, then =consult-lsp= is made for you.

#+begin_src emacs-lisp
  (use-package consult-lsp
    :disabled
    :commands (consult-lsp-diagnostics consult-lsp-symbols))
#+end_src

*** lsp-treemacs

For treemacs integrating with lsp-mode.

#+begin_src emacs-lisp
  (use-package lsp-treemacs
    :ensure t
    :after (lsp-mode treemacs)
    :bind
    ("C-c l l" . lsp-treemacs-errors-list) ; TODO move to hydra table
    :config
    (lsp-treemacs-sync-mode 1))
#+end_src
** TODO Tree-sitter

[[https://tree-sitter.github.io/tree-sitter/][Tree-sitter]] is a fast, incremental parsing library that gives Emacs (and other editors) rich, real-time syntax trees of your code. It lets your editor understand code like a compiler does - with actual structure, not just regex-y color rules. As of Emacs 29 it is built in.

I am currently using [[https://github.com/renzmann/treesit-auto][treesit-auto]] to make the setup easier.

Disabled for now as couldn't figure out how to use the correct C++ style.

#+begin_src emacs-lisp
  (use-package treesit-auto
    :disabled
    :custom
    (treesit-auto-install 'prompt)
    :config
    (treesit-auto-add-to-auto-mode-alist 'all)
    (global-treesit-auto-mode))
#+end_src

** flycheck
#+begin_src emacs-lisp
  (use-package flycheck
    :delight
    :hook (lsp-mode . flycheck-mode)
    :bind (:map flycheck-mode-map
                ("M-'" . flycheck-previous-error)
                ("M-\\" . flycheck-next-error))
    :custom (flycheck-display-errors-delay .3))
#+end_src
