myinit.el

;; for easy window switching between multiple windows
(use-package ace-window
  :init
  (progn
    ;; bind ace-window to M-o
    (global-set-key (kbd "M-o") 'ace-window)
    ;; set window lables to home row
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    (custom-set-faces
     '(aw-leading-char-face
   ((t (:inherit ace-jump-face-foreground :height 3.0)))))
    ))

(use-package avy
  :ensure t
  :bind
  ("M-s"     . avy-goto-word-1)
  ("M-g M-g" . 'avy-goto-line))

(use-package window
  :ensure nil
  :bind (("C-x 2" . vsplit-last-buffer)
         ("C-x 3" . hsplit-last-buffer)
         ;; Don't ask before killing a buffer.
         ([remap kill-buffer] . kill-this-buffer))
  :preface
  (defun hsplit-last-buffer ()
    "Focus to the last created horizontal window."
    (interactive)
    (split-window-horizontally)
    (other-window 1))

  (defun vsplit-last-buffer ()
    "Focus to the last created vertical window."
    (interactive)
    (split-window-vertically)
    (other-window 1)))

(use-package treemacs
  :config
  (progn
    (setq treemacs-hide-dot-git-directory          t
          treemacs-move-files-by-mouse-dragging    t
          treemacs-sorting                         'alphabetic-asc
          treemacs-width                           28)
    (treemacs-project-follow-mode t)
    (treemacs-resize-icons 24))
  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("C-x t 1"   . treemacs-delete-other-windows)
        ("C-x t d"   . treemacs-select-directory)
        ("C-x t t"   . treemacs)
        ("C-x t B"   . treemacs-bookmark)
        ("C-x t C-t" . treemacs-find-file)
        ("C-x t M-t" . treemacs-find-tag)))

(use-package treemacs-projectile
  :after treemacs)

(use-package treemacs-magit
  :after treemacs)

(use-package treemacs-all-the-icons
  :after treemacs all-the-icons
  :config (treemacs-load-theme "all-the-icons"))

(use-package ultra-scroll
:init
(setq scroll-conservatively 3 ; or whatever value you prefer, since v0.4
      scroll-margin 0)        ; important: scroll-margin>0 not yet supported
:config
(ultra-scroll-mode 1))

(use-package drag-stuff
  :ensure t
  :config
  (drag-stuff-global-mode 1)
  (global-set-key (kbd "s-<down>") 'drag-stuff-down)
  (global-set-key (kbd "s-<up>") 'drag-stuff-up)
  (global-set-key (kbd "s-<right>") 'drag-stuff-right)
  (global-set-key (kbd "s-<left>") 'drag-stuff-left))

(use-package yasnippet-snippets
  :after yasnippet
  :config (yasnippet-snippets-initialize))

(use-package yasnippet
  :delight yas-minor-mode "ﾃ遵"
  :config (yas-global-mode))

(use-package ivy-yasnippet :after yasnippet)

(use-package iedit
  :bind
  ("C-r" . iedit-mode)
  :config
  (define-key iedit-mode-keymap (kbd "C-;") nil)) ;; unbind as used for commend-line

(use-package undo-tree
  :init
  (global-undo-tree-mode)
  :config
  (setq undo-tree-visualizer-diff t) ;; show difs
  (setq undo-tree-auto-save-history t) ;; save history to file
  (setq undo-tree-visualizer-timestamps t) ;; show timestamps

  ;; Create the undo history directory if it doesn't exist
  (let ((undo-history-dir (expand-file-name "undo-history" user-emacs-directory)))
    (unless (file-directory-p undo-history-dir)
  (make-directory undo-history-dir)))

  ;; Set the directory for undo history files
  (setq undo-tree-history-directory-alist
    `((".*" . ,(expand-file-name "undo-history" user-emacs-directory)))))

(use-package multiple-cursors
  :bind
  ;; (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
  ;; (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
  ("C->" . mc/mark-next-like-this)
  ("C-<" . mc/mark-previous-like-this))

(use-package expand-region
  :bind
  ("C-=" . er/expand-region))

(use-package programming
  :ensure nil
  :hook
  (;; Add line numbers to progam modes
   (prog-mode . display-line-numbers-mode)
   ;; Line Wrappings
   (prog-mode . (lambda () (setq truncate-lines t))))
  :custom
  ;; Treat CamelCase as distinct words
  (global-subword-mode 1))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook ((prog-mode . lsp-deferred)
         (lsp-mode . lsp-enable-which-key-integration))
  :custom
  (lsp-enable-folding nil)
  (lsp-enable-links nil)
  (lsp-enable-snippet nil)
  (lsp-keymap-prefix "C-c l")
  (lsp-prefer-capf t)                   ;; Use completion-at-point-functions
  (lsp-headerline-breadcrumb-enable t)) ;; Show breadcrumbs

  ;; Clangd is fast
(setq gc-cons-threshold (* 100 1024 1024)
      read-process-output-max (* 1024 1024)
      treemacs-space-between-root-nodes nil
      company-idle-delay 0.500
      company-minimum-prefix-length 1
      lsp-idle-delay 0.1)  ;; clangd is fast

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-sideline-enable t)
  (lsp-ui-doc-enable t)
  (lsp-ui-doc-position 'at-point))

(use-package consult-lsp
  :commands (consult-lsp-diagnostics consult-lsp-symbols))

(use-package lsp-treemacs
  :ensure t
  :after (lsp-mode treemacs)
  :bind
  ("C-c l l" . lsp-treemacs-errors-list) ; TODO move to hydra table
  :config
  (lsp-treemacs-sync-mode 1))

(use-package treesit-auto
  :disabled
  :custom
  (treesit-auto-install 'prompt)
  :config
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode))

(use-package flycheck
  :delight
  :hook (lsp-mode . flycheck-mode)
  :bind (:map flycheck-mode-map
              ("M-'" . flycheck-previous-error)
              ("M-\\" . flycheck-next-error))
  :custom (flycheck-display-errors-delay .3))
