myinit.org
** dap-mode

[[https://github.com/emacs-lsp/dap-mode][dap-mode]] uses the Debug Adapter Protocol wire protocol for communication between client and Debug Server. You won't find a better debugger.

#+begin_src emacs-lisp
  (use-package dap-mode
    :after lsp-mode
    :hook (dap-stopped . (lambda (arg) (call-interactively #'dap-hydra)))
    :config
    (dap-auto-configure-mode)  ;; Automatically configures dap-mode
    (require 'dap-cpptools)

    (dap-register-debug-template
     "cpptools::main"
     (list :type "cppdbg"
           :request "launch"
           :MIMode "lldb"
           :program "${workspaceFolder}/build/main"
           :cwd "${workspaceFolder}"))

    (dap-register-debug-template
     "cpptools::main-input"
     (list :name "cpptools::main-input"
           :type "cppdbg"
           :request "launch"
           :MIMode "lldb"
           :program "${workspaceFolder}/build/main"
           :cwd "${workspaceFolder}"
           :externalConsole t)))
#+end_src
** TODO company-mode
TODO try corfu as company boxes messes with pop os auto tiling

Auto-completion with GNU Emacs is mainly combined with LSP mode. Therefore the development of any programming language is made easier with auto-completion, which involves a completion at point followed by the display of a small pop-in containing the candidates. I am using [[https://github.com/company-mode/company-mode][company-mode]] which is easier and smoother to configure.

#+begin_src emacs-lisp
  (use-package company
    :after lsp-mode
    :hook (prog-mode . company-mode)
    :custom
    (company-show-quick-access t)
    (company-idle-delay 0.2)              ;; Delay before suggestions popup
    (company-minimum-prefix-length 1)     ;; Show suggestions after 1 char
    (company-tooltip-align-annotations t) ;; Align annotations (e.g., function signatures)
    (company-preview-frontend t)          ;; show first completion candidate inline
    (company-show-doc-buffer nil))

  ;; for visuals
  ;; this doesnt work with pop os auto tilling
  (use-package company-box
    :disabled
    :after company
    :init (setq company-box-icons-alist 'company-box-icons-all-the-icons)
    :hook (company-mode . company-box-mode))
#+end_src
** Git
*** TODO magit
Is magit not build in? is there any other settings i should use

#+begin_src emacs-lisp
  (use-package magit)
#+end_src
*** git-gutter

These packages are showing the git difference. I have set it to be similar to VScode.

#+begin_src emacs-lisp
  (use-package git-gutter
    :ensure t
    :hook ((prog-mode . git-gutter-mode)
       (org-mode . git-gutter-mode))
    :config
    (setq git-gutter:update-interval 0.5)) ;; if too small causes lagging

  ;; makes it prettier
  (use-package git-gutter-fringe
    :ensure t
    :config
    (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))

  ;; Customize the git-gutter:modified face to use different colours
  (set-face-foreground 'git-gutter-fr:modified "#2375B3")
  ;; (set-face-foreground 'git-gutter-fr:added    "blue")
  ;; (set-face-foreground 'git-gutter-fr:deleted  "white")
#+end_src

*** Git sync
This hydra command lets me quickly sync repos to the correct server

#+begin_src emacs-lisp
  ;; Define a hydra to choose the target server (nersc or deucalion)
  (defhydra hydra-sync-git (:color blue)
    "
  Sync to which server?
  _n_ NERSC
  _d_ Deucalion
  _q_ Quit
  "
    ("n" (run-sync-git-tracked-script "nersc"))
    ("d" (run-sync-git-tracked-script "deucalion"))
    ("q" nil "quit"))

  ;; Function to run the sync script with an argument
  (defun run-sync-git-tracked-script (target)
    "Run the sync_git_tracked.sh script with the specified TARGET argument."
    (interactive "sTarget (nersc or deucalion): ") ;; Allow the hydra to pass this value
    (let ((default-directory (locate-dominating-file default-directory ".git")))
      (if default-directory
          (progn
            ;; Run the sync script with the argument based on the hydra choice
            (let ((script (concat "~/git/scripts/sync_git_tracked.sh")))
              (if (file-executable-p script)
                  (call-process-shell-command (concat script " " target) nil "*scratch*")
                (message "Error: sync_git_tracked.sh not found or not executable."))))
        (message "Error: Not inside a Git repository!"))))

  ;; Bind the hydra to a keyboard shortcut
  (global-set-key (kbd "C-c s") 'hydra-sync-git/body)
#+end_src

** Parenthesis
*** TODO rainbow-delimiters

TODO add link

Highlights delimiters according to their depth.

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook
    (prog-mode . rainbow-delimiters-mode))
#+end_src

*** TODO smartparens
Need to learn how to use this. Might only be good to use strict mode with emacs files

#+begin_src emacs-lisp
  (use-package smartparens
    :disabled
    :ensure t
    :hook
    ( ;; (prog-mode . smartparens-strict-mode)
     (markdown-mode-hook . turn-on-smartparens-mode)) ;; can use strict-mode also
    :config
    ;; load default config
    (require 'smartparens-config)
    :bind
    ("C-M-a" . sp-beginning-of-sexp)
    ("C-M-e" . sp-end-of-sexp)
    ("C-<up>" . sp-up-sexp)
    ("C-<down>" . sp-down-sexp)
    ("M-<up>" . sp-backward-up-sexp)
    ("M-<down>" . sp-backward-down-sexp)
    ("M-[" . sp-backward-unwrap-sexp)
    ("M-]" . sp-unwrap-sexp))
#+end_src

** Indentation
My setup for dealing with indentation

*** aggressive-indent
#+begin_src emacs-lisp
  (use-package aggressive-indent
    :custom
    (aggressive-indent-comments-too t))
#+end_src

*** highlight-indentation-guides

Currently using [[https://github.com/DarthFennec/highlight-indent-guides][highlight-indentation-guides]] for my indentation highlight as its easy to use. Although I'd like to eventually find a solution to highlight blank spaces as well.

#+begin_src emacs-lisp
(use-package highlight-indent-guides
  :hook (prog-mode . highlight-indent-guides-mode)
  :config
  ;; Use thin character style
  (setq highlight-indent-guides-method 'character)
  (setq highlight-indent-guides-character ?|) ;; Unicode thin vertical bar
  (setq highlight-indent-guides-responsive 'top) ;; Active indent
  (setq highlight-indent-guides-auto-enabled t)

  ;; Show guides even on blank lines
  (setq highlight-indent-guides-show-leading-blank-lines t)

  ;; Customize colors to fit doom-one
  (set-face-foreground 'highlight-indent-guides-character-face "#3f444a")
  (set-face-foreground 'highlight-indent-guides-top-character-face "#875faf")
  (set-face-foreground 'highlight-indent-guides-stack-character-face "#5c5f77"))
#+end_src

*** highlight-indentation

I was using [[https://github.com/antonj/Highlight-Indentation-for-Emacs][highlight-indentation]] but it didn't look nice and the active highlighting was buggy. But it did highlight empty lines.

#+begin_src emacs-lisp
;; (use-package highlight-indentation
;;   :hook ((prog-mode . highlight-indentation-mode)
;;          (prog-mode . highlight-indentation-current-column-mode))
;;    :custom
;;    (highlight-indentation-blank-lines t) ;; Enable highlighting of blank lines.
;;    :config
;;    ;; Customize the face for the indent guides
;;    (set-face-background 'highlight-indentation-face "#3f444a")
;;    (set-face-background 'highlight-indentation-current-column-face "#5f8787"))
#+end_src
** Languages
*** TODO C++
TODO Need to set this all up better

#+begin_src emacs-lisp
  ;; make sure up to date
  (require 'cc-mode)

  ;; set .h files to use c++ mode instead
  (add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
#+end_src

If you follow [[https://google.github.io/styleguide/cppguide.html][Google's C/++ conventions]], the [[https://github.com/google/styleguide/blob/gh-pages/google-c-style.el][google-c-style]] package changes some default values to ensure that you follow these conventions as much as possible.

#+begin_src emacs-lisp
  (use-package google-c-style
    :disabled
    :hook (((c-mode c++-mode) . google-set-c-style)
           (c-mode-common . google-make-newline-indent)))
#+end_src

*** Python
Look [[https://github.com/rememberYou/.emacs.d/blob/master/config.org#python][here]] when i need these
*** cmake
#+begin_src emacs-lisp
  (use-package cmake-mode
    :hook (cmake-mode . lsp-deferred)
    :mode ("CMakeLists\\.txt\\'" "\\.cmake\\'"))

  ;; for better sytax colours
  (use-package cmake-font-lock
    :hook (cmake-mode . cmake-font-lock-activate))
#+end_src
*** make
#+begin_src emacs-lisp
  ;; use makefile-mode for MakeFiles
  (add-to-list 'auto-mode-alist '("Makefile" . makefile-mode))
#+end_src

* TODO Writing packages
This packages are to improve all things writing.
** TODO Defaults
TODO maybe update name, and add intro summary

#+begin_src emacs-lisp
  (use-package writing
    :ensure nil
    :hook
    ;; Line Wrappings
    (text-mode . turn-on-visual-line-mode))
#+end_src
